Tekla Open API Reference for Tekla Structures 2025
Localization.Util.PropertyLocalizer Constructor
 Creates a new instance of the localizer.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PropertyLocalizer(
	string propertyName
)
Public Sub New (
	propertyName As String
)
Parameters
propertyName
Type: System.String
The name of the property.
See Also
Reference
Localization.Util.PropertyLocalizer Class
Tekla.Structures.Dialog Namespace